[
    {
        "latitude": 8.3582,
        "longitude": 124.8581,
        "message": "Landslide-Prone Area: Barangay Damilag",
        "description": "Frequent heavy rainfall and deforestation have made the slopes in Barangay Damilag vulnerable to landslides, especially during the rainy season.",
        "seedling_suggestion": "Suggested Seedling: Narra - Known for its strong and deep roots, which help in stabilizing soil."
    },
    {
        "latitude": 8.3609,
        "longitude": 124.8625,
        "message": "Landslide-Prone Area: Barangay Alae",
        "description": "The steep terrain and poorly compacted soil in Barangay Alae, combined with water run-off from nearby hills, contribute to frequent landslides in this area.",
        "seedling_suggestion": "Suggested Seedling: Bamboo - Fast-growing and excellent for preventing soil erosion on steep slopes."
    },
    {
        "latitude": 8.3655,
        "longitude": 124.8721,
        "message": "Landslide-Prone Area: Barangay Dicklum",
        "description": "Known for its loose soil and proximity to a fault line, Barangay Dicklum experiences landslides after even moderate seismic activity or heavy rain.",
        "seedling_suggestion": "Suggested Seedling: Mahogany - A large tree with a deep root system that can strengthen loose soil."
    },
    {
        "latitude": 8.3698,
        "longitude": 124.8756,
        "message": "Landslide-Prone Area: Barangay San Miguel",
        "description": "The area's natural drainage system is insufficient to handle large volumes of water during typhoons, leading to erosion and occasional landslides.",
        "seedling_suggestion": "Suggested Seedling: Vetiver Grass - Ideal for stabilizing soil due to its extensive root system that can grow vertically into the ground."
    },
    {
        "latitude": 8.3723,
        "longitude": 124.8802,
        "message": "Landslide-Prone Area: Barangay Lunocan",
        "description": "Frequent soil erosion along the steep inclines of Barangay Lunocan has caused landslides, particularly near roadways and agricultural areas.",
        "seedling_suggestion": "Suggested Seedling: Acacia - This tree is great for erosion control and has a spreading root system to stabilize slopes."
    },
    {
        "latitude": 8.3544,
        "longitude": 124.8690,
        "message": "Landslide-Prone Area: Barangay Lingating",
        "description": "Deforestation and land-use changes for farming have weakened the soil structure in Barangay Lingating, increasing the risk of landslides.",
        "seedling_suggestion": "Suggested Seedling: Ipil-Ipil - A nitrogen-fixing plant that helps restore soil quality and reduces erosion."
    },
    {
        "latitude": 8.3758,
        "longitude": 124.8610,
        "message": "Landslide-Prone Area: Barangay Kalugmanan",
        "description": "Kalugmanan's high slopes combined with logging activities have destabilized the ground, making the area prone to landslides during the rainy season.",
        "seedling_suggestion": "Suggested Seedling: Molave - A durable tree species with strong roots ideal for rehabilitating degraded areas."
    },
    {
        "latitude": 8.3630,
        "longitude": 124.8501,
        "message": "Landslide-Prone Area: Barangay Santiago",
        "description": "The combination of loose sedimentary rock and poor water drainage has led to frequent landslides in Barangay Santiago, especially near riverbanks.",
        "seedling_suggestion": "Suggested Seedling: Mangrove Trees - Suitable for riverbanks, these trees stabilize soil and reduce erosion caused by water runoff."
    }
]
